codeigniter/app/Controllers/Clients.php

SELECT *
FROM `clients`
---
    public function index()
    {
        $data['clients'] = $this->model->findAll();