codeigniter/app/Models/Clients_model.php

    public function getClient($id = false)
    {
        if ($id === false) {
            return $this->findAll();
        }

        return $this->getWhere(['id' => $id]);
---
SELECT *
FROM `clients`
WHERE `id` = '3'

    public function saveClient(array $data)
    {
        return $this->insert($data);
---
INSERT INTO `clients` (`nombre`, `apellido`) VALUES ('juan', 'duran')

    public function updateClient(int $id, array $data)
    {
        return $this->update($id, $data);
---
UPDATE `clients` SET `nombre` = 'jason', `apellido` = 'aronc'
WHERE `clients`.`id` IN (3)

    public function deleteClient(int $id)
    {
        return $this->delete($id);
---
DELETE FROM `clients`
WHERE `id` IN (5)